#+begin_verse
npm i -g typescript-language-server; npm i -g typescript
#+end_verse
#+begin_src emacs-lisp
  (add-hook 'js-mode-hook 'lsp)
#+end_src

#+RESULTS:
| lsp |
